---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.Constant
enum: Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule
source: html/7fa26a3f-1640-4497-c60d-ac7af7624bb7.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.Constant

This rule will apply a constant demand factor to the loads, regardless of values.
 It will also be the default for any newly created demand factor, and the default used if a
 demand factor cannot be found for a load classification.